[
  {
    "date": "2017-11-28",
    "time": "11am-12pm",
    "title": "PARALLEM: massively Parallel Landscape Evolution Modelling",
    "speaker": "Dr Stephen McGough, Newcastle University",
    "location": "Lecture Theatre G02, Firth Court",
    "description": "<strong>No offical talks are held by GPU Computing group in October but we highly recommend this upcoming seminar.</strong><br/><br/>Landscape Evolution Modelling (LEM) is used to predict how landscapes evolve over the millennia due to weathering and erosion. LEM’s normally operate on a regular grid of cells each representing the height of a point within a landscape. The process can be broken up into the following stages applied to each cell: determination of the flow direction of water out of that cell, summation of the volume of water flowing through the cell and computation of the erosion / deposition in the cell. This process is repeated at regular intervals – either an annual time-step (due to computation complexity) or once for each major storm-event – for periods of around one million years. <br/> Within each year/rainstorm there is great potential for speedup when executing on a GPGPU – flow direction for most cells can be performed independently, flow accumulation can easily be performed in parallel. However, due to certain ‘real world’ landscape features this potential can easily be lost. Landscape features such as plateaus – where all cells in a region have the same height – or sinks – (sets of) cells which have no lower neighbour, meaning water cannot escape – prevent optimal speedup being achieved. Likewise, computing the volume of water passing through a cell is inherently sequential – the sum of water through a cell at the end of a river depends on knowing the volume of water passing through all points upstream.<br/> CUDA algorithms have been developed for computing the LEM processes: Flow direction can be computed independently for each cell; A parallel breadth-first algorithm can be used for routing water over a plateau to an outlet cell; A parallel technique for ‘filling’ sinks (making them into lakes) which performs much of its work through parallel pointer jumping is used. Flow accumulation can be performed using a developed ‘correct’ algorithm where each cell which has no incorrect flows entering it can be computed and marked correct. The process of erosion / deposition can then be performed in a similar manner to flow accumulation with the eroded material being passed around. <br/> In this talk we will present parallel techniques for overcoming these problems, demonstrating between two and three orders of magnitude speedup over the best-in- class LEM software for landscapes between 0.1 and 56 million cells – far larger than the traditional 5 thousand cell simulations which have previously been performed. This has led to a need for a re-evaluation of the models used within the LEM community. Errors in LEM simulation results, which have been used over the last 30+ years, have been attributed to the very small simulation sizes. However, with our 46+ million cell simulations – a realistic scale – we are now able to determine that these errors are not due to scale but rather due to the equations themselves.<br/> We will present our approach moving forwards to overcome these limitations and present initial results of this work.",
    "register_link": "https://gpucomp_seminar_parallem.eventbrite.co.uk/",
    "slide_link": "/static/seminars/2017_11_28_gpu_parallem_talk.pdf",
    "image_link": "/static/seminars/2017_11_28_parallem.jpg"
  },
  {
    "date": "2017-09-27",
    "time": "1-2pm",
    "title": "Opportunities and challenges for spiking neural networks on GPUs",
    "speaker": "Dr Thomas Nowotny, University of Sussex",
    "location": "Workroom 3 (205), The Diamond",
    "description": "In the past 6 years, we have developed the GeNN (GPU enhanced neuronal networks) framework for GPU accelerated spiking neuronal network simulations. In essence, GeNN is based on a simple design of code generation that allows a large extent of flexibility for computational models while at the same time taking care of some of the GPU specific optimisation work in the background. In this talk I will present the main features of GeNN, its design principles and show benchmarks. I will then discuss limitations, both specific to GeNN and to numerical simulation work on GPUs more generally and present some further work, including the SpineML-GeNN and Brian2GeNN interfaces. GeNN is developed within the Green Brain (http://greenbrain.group.shef.ac.uk/) and Brains on Board (http://brainsonboard.co.uk/) projects and is available under GPL v2 at Github (http://genn-team.github.io/genn/)",
    "register_link": "https://gpucomp_seminar_thomas_nowotny.eventbrite.co.uk/",
    "slide_link": "https://sussex.box.com/s/8i7dby89e6fj2t8lw447y68dkrsc1oo5",
    "image_link": "/static/seminars/2017_09_27_thomas_nowotny.jpg"
  },
  {
    "date": "2017-08-29",
    "time": "1-2pm",
    "title": "Containers for High Performance Computing",
    "speaker": "Twin Karmakharm, Research Software Engineer, University of Sheffield",
    "location": "Workroom 3 (205), The Diamond",
    "description": "Containerization is a lightweight virtualisation technology where users can package workflows, software, libraries and data for running on various machines with minimal loss of performance. The technology can be used a way for scientists to deploy custom software on the HPC cluster and easily share reproducible software along with their data. The talk explores the concept of containers and existing container technologies suitable for the HPC. Particular focus is given for Singularity which has recently been introduced on the new Sheffield Advance Research Computer (ShARC) cluster.",
    "register_link": "https://gpucomp_seminar_containers.eventbrite.co.uk",
    "slide_link": null,
    "image_link": "/static/seminars/2017_08_29_gpu_containers.jpg"
  },
  {
    "date": "2017-06-29",
    "time": "4-5pm",
    "title": "From Democratic Consensus to Cannibalistic Hordes: The Principles of Collective Animal Behaviour",
    "speaker": "Prof. Iain Couzin",
    "location": "Workroom 2 (G05), The Diamond",
    "description": "<strong>No offical talks are held by GPU Computing group in June but we highly recommend this upcoming seminar.</strong><br/><br/> The inaugural Complex Systems Summer Lecture will be delivered by Prof Iain Couzin, Director of the Department of Collective Behaviour at the Max Planck Institute for Ornithology, at Konstanz University, Germany. The topic of the lecture will be 'From Democratic Consensus to Cannibalistic Hordes: The Principles of Collective Animal Behaviour'. Prof Couzin's work combines experiment and theory to understand how animals in groups behave; he is particularly known for work on locusts and on fish: <a href='http://collectivebehaviour.com'>http://collectivebehaviour.com</a>.<br/><br/>The Complex Systems Summer Lecture is a public lecture organised by the Complex Systems Modelling Group, in the Department of Computer Science at the University of Sheffield: <a href='https://www.sheffield.ac.uk/dcs/research/groups/complex-systems-modelling'>https://www.sheffield.ac.uk/dcs/research/groups/complex-systems-modelling</a>",
    "register_link": "https://www.eventbrite.co.uk/e/complex-systems-summer-lecture-tickets-33333921657",
    "slide_link": null,
  },
  {
    "date": "2017-05-30",
    "time": "1-2pm",
    "title": "Towards achieving GPU-native adaptive mesh refinement",
    "speaker": "Ania Brown, Research Software Engineer, Oxford e-Research Centre",
    "location": "Workroom 2 (G05), The Diamond",
    "description": "Modern simulations model increasingly complex multiscale systems, and the need to capture details at multiple length scales can lead to large memory requirements. Adaptive mesh refinement (AMR) is a method for reducing memory cost by varying the accuracy in each region to match the physical characteristics of the simulation, at the cost of increased data structure complexity. This complexity is a particular problem on the GPU architecture, which is most naturally suited to regular data sets. I will describe some of the optimisation and software challenges that need to be considered when implementing AMR on GPUs, based on my experience working on a GPU-native framework for stencil calculations on a tree-based adaptively refined mesh as part of my Master degree. Topics covered will include achieving coalesced access with the AMR data structure, memory defragmentation after grid changes and load balancing using space-filling curves.",
    "notes": "Refreshments will be available from 12.30pm. Extra time has been allocated for questions and discussions at 2.00-2.30pm.",
    "register_link": "https://www.eventbrite.co.uk/e/talk-towards-achieving-gpu-native-adaptive-mesh-refinement-tickets-33614872990",
    "slide_link": "/static/seminars/2017_05_30_gpu_amr_talk.pdf",
    "image_link": "/static/seminars/2017_05_30_gpu_amr.jpg"
  }
]
